xlyric/pv-router-esp32/src/functions/webFunctions.h
#ifndef WEBFUNCTIONS
#define WEBFUNCTIONS

//***********************************
//************* LIBRAIRIES ESP
//***********************************
#ifdef ESP32
  #include <AsyncTCP.h>
  #include <esp_task_wdt.h>
#elif defined(ESP8266)
  #include <ESPAsyncTCP.h>
#endif
#include <ESPAsyncWebServer.h>

//***********************************
//************* PROGRAMME PV ROUTER
//***********************************
#include "appweb.h"
#include "functions/minuteur.h"
#ifdef WEBSOCKET_CLIENT
  #include "functions/websocket.h"
#endif

//***********************************
//************* Variables externes
//***********************************
extern DisplayValues gDisplayValues;
extern Configmodule configmodule; 
extern Configwifi configwifi; 
extern Logs logging;
extern Programme programme; 
extern Programme programme_relay1; 
extern Programme programme_relay2; 
extern Programme programme_marche_forcee;
extern Programme programme_batterie;
extern Memory task_mem; 
extern SemaphoreHandle_t mutex; 


//***********************************
//************* Déclaration de fonctions
//***********************************
extern bool boost();

//***********************************
//************* Variables locales
//***********************************
String inputMessage;
AsyncWebServer server(80);
String getMinuteur(const Programme& minuteur);
String getMinuteur();
String return_Memory();

//***********************************
//************* notfound()
//***********************************
void notFound(AsyncWebServerRequest *request) {
  request->send(404, "text/plain", "Not found");
}

//***********************************
//************* compress_html()
//***********************************
void compress_html(AsyncWebServerRequest *request,String filefs , String format ) {
  AsyncWebServerResponse *response = request->beginResponse(SPIFFS, filefs, format);
  response->addHeader("Content-Encoding", "gzip");
  response->addHeader("Cache-Control", "max-age=604800");
  yield();
  request->send(response);
}

//***********************************
//************* serveur_response()
//***********************************
void serveur_response(AsyncWebServerRequest *request, String response) {
  yield();
  request->send(200, "text/plain", response.c_str());
}

//***********************************
//************* call_pages()
//***********************************
void call_pages() {
  if (AP) {
      server.on("/",HTTP_GET, [](AsyncWebServerRequest *request) {
        if(SPIFFS.exists("/index.html.gz")){
          compress_html(request,"/index-ap.html.gz", "text/html");
        }
        else {request->send(200, "text/html", "<html><body>Filesystem is not present. <a href='https://ota.apper-solaire.org/firmware/spiffs-ttgo.bin'>download it here</a> <br>and after  <a href='/update'>upload on the ESP here </a></body></html>" ); }
      });

      server.on("/config.html", HTTP_GET, [](AsyncWebServerRequest *request){
        if(SPIFFS.exists("/config.html.gz")){
          compress_html(request,"/config-ap.html.gz", "text/html");
        }
        else {
          serveur_response(request, SPIFFSNO);
        }
      });
    }
    else {
      server.on("/",HTTP_GET, [](AsyncWebServerRequest *request) {
        if(SPIFFS.exists("/index.html.gz") ){
          #ifndef LIGHT_FIRMWARE
            compress_html(request,"/index.html.gz", "text/html");
          #else
            compress_html(request,"/index-light.html.gz", "text/html");
          #endif
        }
        else {
          serveur_response(request, SPIFFSNO);
        }
      });

      server.on("/config.html", HTTP_GET, [](AsyncWebServerRequest *request){
        if(SPIFFS.exists("/config.html.gz")){
          #ifdef LIGHT_FIRMWARE
              compress_html(request,"/config-light.html.gz", "text/html");
          #elif ESP32D1MINI_FIRMWARE
            compress_html(request,"/config-dimmer.html.gz", "text/html");
          #else
            compress_html(request,"/config.html.gz", "text/html");
          #endif
        }
        else {
          serveur_response(request, SPIFFSNO);
        }
      });
    }

    // pages  statiques
    // Define static files array with URL paths and file paths
    const char* staticFiles[][2] = {
      {"/all.min.css", "/all.min.css"},
      {"/jquery.min.js", "/jquery.min.js"},
      {"/bootstrap.bundle.min.js", "/bootstrap.bundle.min.js"},
      {"/bootstrap.bundle.min.js.map", "/bootstrap.bundle.min.js.map"},
      {"/fa-solid-900.woff2", "/fa-solid-900.woff2"},
      {"/favicon.ico", "/favicon.ico"},
      {"/sb-admin-2.min.css", "/sb-admin-2.min.css"},
      {"/sb-admin-2.js", "/sb-admin-2.js"},
      {"/log.html", "/log.html"},
      {"/envoy.html", "/envoy.html"},
      {"/minuteur.html", "/minuteur.html"},
      {"/wifi.html", "/wifi.html"},
      {"/mqtt.html", "/mqtt.html"},
      {"/mqtt.json", "/mqtt.json"},
      {"/wifi.json", "/wifi.json"},
      {"/config.json", "/config.json"},
      {"/enphase.json", "/enphase.json"}
    };
  
    for (const auto& file : staticFiles) {
      if (strstr(file[0], ".json")) {
        server.serveStatic(file[0], SPIFFS, file[1]); // les json ne sont pas en cache
      } 
      else {
        server.serveStatic(file[0], SPIFFS, file[1]).setCacheControl("max-age=31536000"); // par contre les autres fichiers sont en cache
      }
    }

    server.on("/state", HTTP_GET, [](AsyncWebServerRequest *request){
      request->send(200, "application/json", getState().c_str());
    });

    server.on("/stateshort", HTTP_GET, [](AsyncWebServerRequest *request){
      request->send(200, "application/json", getState_short().c_str());
    });

    server.on("/statefull", HTTP_GET, [](AsyncWebServerRequest *request){
      request->send(200, "application/json", getStateFull().c_str());
    });
    
    server.on("/config", HTTP_GET, [](AsyncWebServerRequest *request){
      request->send(200, "application/json", getconfig().c_str());

    });

    // ajout de la commande de boost 2h   
    server.on("/boost", HTTP_ANY, [] (AsyncWebServerRequest *request) {
      boost();    
      request->send(200, "application/json",  getMinuteur(programme_marche_forcee));
    });


