xlyric/pv-router-esp32/src/functions/webFunctions.h
    /// beta ? 
    server.on("/cosphi", HTTP_GET, [](AsyncWebServerRequest *request){
      serveur_response(request, getcosphi());
    });
    
    ///////////////
    //// wifi
    ///////////////
    server.on("/getwifi", HTTP_ANY, [] (AsyncWebServerRequest *request) {
      serveur_response(request, getwifi());
    });

    server.on("/ping", HTTP_GET, [](AsyncWebServerRequest *request) {
      request->send(200, "text/plain", "pong");
    });

    ///////////////
    //// Enphase
    ///////////////
    server.on("/getenvoy", HTTP_ANY, [] (AsyncWebServerRequest *request) {
      serveur_response(request, getenvoy());
    });

    ///////////////
    ///// MQTT
    ///////////////
    server.on("/getmqtt", HTTP_ANY, [] (AsyncWebServerRequest *request) {
      request->send(200, "application/json",  getmqtt().c_str()); 
    });

    ///////////////
    ///// LOGS
    ///////////////
    server.on("/log.txt", HTTP_ANY, [] (AsyncWebServerRequest *request) {
      request->send(SPIFFS, "/log.txt", "text/plain"); 
    });
    
    /// il serait bien que /getmqtt et getwifi soit directement en processing de l'appel de la page 

    ///////////////
    //// logs ////
    ///////////////
    server.on("/cs", HTTP_ANY, [](AsyncWebServerRequest *request){
      logging.Set_log_init("}1");
      serveur_response(request, logging.Get_log_init().c_str());
      // reinit de logging.log_init 
      logging.reset_log_init(); 
    });


    server.on("/reboot", HTTP_ANY, [](AsyncWebServerRequest *request){
    #ifndef LIGHT_FIRMWARE
      const int bufferSize = 150; //  Taille du tampon pour stocker le message
      char raison[bufferSize]; // NOSONAR
      getLocalTime( &timeinfo );
      snprintf(raison, bufferSize, "reboot manuel: %s", asctime(&timeinfo) ); 

        client.publish("memory/Routeur", raison, true);
    #endif
    request->redirect("/");
    yield();
    delay(1000);
    yield();
    delay(1000);
    yield();
    config.restart = true;
    ESP.restart();
    });
    
    // reset de la detection dallas précédente 
    server.on("/resetdallas", HTTP_ANY, [](AsyncWebServerRequest *request){
      config.dallas_present = false; 
      config.saveConfiguration();
      request->redirect("/");
 
    });

    server.onNotFound(notFound);

    /////////////////////////
    ////// mise à jour parametre d'envoie vers domoticz et récupération des modifications de configurations
    /////////////////////////
    server.on("/get", HTTP_ANY, [] (AsyncWebServerRequest *request) {
      ///  doc  /get?disengage_dimmer=on
      if (request->hasParam(PARAM_INPUT_1)) {
        const char* engagedimmer;
        if(request->getParam(PARAM_INPUT_1)->value() == "on") {
          engagedimmer = "dimmer disengaged";
          gDisplayValues.dimmer_disengaged = true;
        }
        else {
          engagedimmer = "dimmer engaged";
          gDisplayValues.dimmer_disengaged = false;
        }
        request->send(200, "text/html", engagedimmer);
      }
                              
      // doc /get?cycle=x
      if (request->hasParam(PARAM_INPUT_save)) { Serial.println(F("Saving configuration..."));
        logging.Set_log_init(config.saveConfiguration().c_str(),true); // configuration sauvegardée
      }
                              
      if (request->hasParam(PARAM_INPUT_2)) { 
        config.cycle = request->getParam(PARAM_INPUT_2)->value().toInt(); 
      }
      if (request->hasParam(PARAM_INPUT_3)) { 
        config.readtime = request->getParam(PARAM_INPUT_3)->value().toInt();
      }
      if (request->hasParam(PARAM_INPUT_4)) { 
        config.cosphi = request->getParam(PARAM_INPUT_4)->value().toInt();  
      }
      if (request->hasParam(PARAM_INPUT_dimmer)) { 
        request->getParam(PARAM_INPUT_dimmer)->value().toCharArray(config.dimmer,64); 
        #ifdef WEBSOCKET_CLIENT
        closeWebSocket(); setupWebSocket(); 
        #endif
      }

      if (request->hasParam(PARAM_INPUT_server)) { request->getParam(PARAM_INPUT_server)->value().toCharArray(config.hostname,16);  }
      if (request->hasParam(PARAM_INPUT_delta)) { config.delta = request->getParam(PARAM_INPUT_delta)->value().toInt(); }
      if (request->hasParam(PARAM_INPUT_deltaneg)) { config.deltaneg = request->getParam(PARAM_INPUT_deltaneg)->value().toInt(); }
      if (request->hasParam(PARAM_INPUT_port)) { config.port = request->getParam(PARAM_INPUT_port)->value().toInt(); }
      if (request->hasParam(PARAM_INPUT_IDX)) { config.IDX = request->getParam(PARAM_INPUT_IDX)->value().toInt();}
      if (request->hasParam(PARAM_INPUT_IDXdimmer)) { config.IDXdimmer = request->getParam(PARAM_INPUT_IDXdimmer)->value().toInt();}
      if (request->hasParam("idxdallas")) { config.IDXdallas = request->getParam("idxdallas")->value().toInt();}
      if (request->hasParam(PARAM_INPUT_API)) { request->getParam(PARAM_INPUT_API)->value().toCharArray(config.apiKey,64);}
      if (request->hasParam(PARAM_INPUT_dimmer_power)) {gDisplayValues.dimmer = request->getParam( PARAM_INPUT_dimmer_power)->value().toInt(); gDisplayValues.change = 1 ;  } 
      if (request->hasParam(PARAM_INPUT_facteur)) { config.facteur = request->getParam(PARAM_INPUT_facteur)->value().toFloat();}
      if (request->hasParam(PARAM_INPUT_tmax)) { config.tmax = request->getParam(PARAM_INPUT_tmax)->value().toInt();}
      if (request->hasParam("resistance")) { config.charge1 = request->getParam("resistance")->value().toInt(); config.calcul_charge(); }
      if (request->hasParam("resistance2")) { config.charge2 = request->getParam("resistance2")->value().toInt(); config.calcul_charge();}
      if (request->hasParam("resistance3")) { config.charge3 = request->getParam("resistance3")->value().toInt(); config.calcul_charge();}
      if (request->hasParam("screentime")) { config.ScreenTime = request->getParam("screentime")->value().toInt(); } 
      if (request->hasParam("voltage")) { config.voltage = request->getParam("voltage")->value().toInt();}
      if (request->hasParam("offset")) { config.offset = request->getParam("offset")->value().toInt();}
      if (request->hasParam("trigger")) { config.trigger = request->getParam("trigger")->value().toInt();}
      
