xlyric/pv-router-esp32/src/functions/webFunctions.h
      /// @brief  wifi
      bool wifimodif=false ; 
      if (request->hasParam("ssid")) { 
        request->getParam("ssid")->value().toCharArray(configwifi.SID,50); wifimodif=true; 
      }
      if (request->hasParam("password")) { 
        char password[50];  
        request->getParam("password")->value().toCharArray(password,50);
        if (strcmp(password,SECURITEPASS) != 0) {  ///sécurisation du mot de passe pas en clair     
          request->getParam("password")->value().toCharArray(configwifi.passwd,50); 
        }      

        wifimodif=true; 
      }
      
      if (wifimodif) { 
        configwifi.sauve_wifi(); 
      }


      // Shelly
      if (request->hasParam("EM")) { 
        request->getParam("EM")->value().toCharArray(config.topic_Shelly,100);  
        #ifdef NORMAL_FIRMWARE
          if (strcmp(config.topic_Shelly,"none") != 0 )  
          client.subscribe(config.topic_Shelly);
          else client.unsubscribe(config.topic_Shelly);
        #endif
      }


      // enphase
      bool enphasemodif=false ; 
      if (request->hasParam("envoyserver")) { request->getParam("envoyserver")->value().toCharArray(configmodule.hostname,16); enphasemodif=true; }
      if (request->hasParam("envoyport")) { request->getParam("envoyport")->value().toCharArray(configmodule.port,5); enphasemodif=true; }
      if (request->hasParam("envmodele")) { request->getParam("envmodele")->value().toCharArray(configmodule.envoy,2);  enphasemodif=true;}
      if (request->hasParam("envversion")) { request->getParam("envversion")->value().toCharArray(configmodule.version,2); enphasemodif=true; }
      if (request->hasParam("envtoken")) { request->getParam("envtoken")->value().toCharArray(configmodule.token,512); enphasemodif=true; }
      if (enphasemodif) { 
        saveenphase(enphase_conf, configmodule);
      }

      //// MQTT
      if (request->hasParam(PARAM_INPUT_mqttserver)) { request->getParam(PARAM_INPUT_mqttserver)->value().toCharArray(config.mqttserver,16);  }
      if (request->hasParam(PARAM_INPUT_publish)) { 
        request->getParam(PARAM_INPUT_publish)->value().toCharArray(config.Publish,100); 
        logging.Set_log_init(config.saveConfiguration().c_str(),true); // configuration sauvegardée   
      }
      if (request->hasParam("mqttuser")) { request->getParam("mqttuser")->value().toCharArray(configmqtt.username,50);  }
      if (request->hasParam("mqttport")) { config.mqttport = request->getParam("mqttport")->value().toInt();}
      if (request->hasParam("mqttpassword")) {
        char password[50];  
        request->getParam("mqttpassword")->value().toCharArray(password,50);
        if (strcmp(password,SECURITEPASS) != 0) {  ///sécurisation du mot de passe pas en clair     
          request->getParam("mqttpassword")->value().toCharArray(configmqtt.password,50); 
        }
        logging.Set_log_init(configmqtt.savemqtt().c_str(),true); // configuration sauvegardée
      }

      //// Dimmer local
      if (request->hasParam("Fusiblelocal")) { config.localfuse = request->getParam("Fusiblelocal")->value().toInt();}
      if (request->hasParam("maxtemp")) { config.tmax = request->getParam("maxtemp")->value().toInt();}

      //reset
      if (request->hasParam(PARAM_INPUT_reset)) {
        Serial.println("Resetting ESP");  
        ESP.restart();
      }

      //// for check boxs in web pages  
      if (request->hasParam("servermode")) { inputMessage = request->getParam( PARAM_INPUT_servermode)->value();
      if (getServermode(inputMessage)) {
        logging.Set_log_init(config.saveConfiguration().c_str(),true); // configuration sauvegardée
        logging.Set_log_init(configmqtt.savemqtt().c_str(),true); // configuration sauvegardée
      }
        request->send(200, "text/html", getconfig().c_str());
      }

      /// relays : 0 : off , 1 : on , other : switch 
      if (request->hasParam("relay1")) { int relay = request->getParam("relay1")->value().toInt(); 
        if ( relay == 0 ) { digitalWrite(RELAY1 , HIGH); } // correction bug de démarrage en GPIO 0
        else if ( relay == 1 ) { digitalWrite(RELAY1 , LOW); } // correction bug de démarrage en GPIO 0
        else if (relay == 2) { digitalWrite(RELAY1, !digitalRead(RELAY1)); }
        int relaystate = digitalRead(RELAY1); 
        char str[8];// NOSONAR
        itoa( relaystate, str, 10 );
        request->send(200, "text/html", str );
      }
      if (request->hasParam("relay2")) { int relay = request->getParam("relay2")->value().toInt(); 
        if ( relay == 0) { digitalWrite(RELAY2 , LOW); }
        else if ( relay == 1 ) { digitalWrite(RELAY2 , HIGH); } 
        else if (relay == 2) { digitalWrite(RELAY2, !digitalRead(RELAY2)); }
        int relaystate = digitalRead(RELAY2); 
        char str[8];// NOSONAR
        itoa( relaystate, str, 10 );
        request->send(200, "text/html", str );
      }
      if (request->hasParam("SCT_13")) { config.SCT_13 = request->getParam("SCT_13")->value().toInt();  
        /// la valeur de la sonde doit être entre 20 et 100 ( )
        if (config.SCT_13 < 20) config.SCT_13 = 20;
        if (config.SCT_13 > 100) config.SCT_13 = 100;
      }

      //// minuteur 
      if (request->hasParam("heure_demarrage")) { request->getParam("heure_demarrage")->value().toCharArray(programme.heure_demarrage,6);  }
      if (request->hasParam("heure_arret")) { request->getParam("heure_arret")->value().toCharArray(programme.heure_arret,6);  }
      if (request->hasParam("temperature")) { programme.temperature = request->getParam("temperature")->value().toInt();  programme.saveProgramme(); }
      serveur_response(request,  getconfig());
      }); 

      server.on("/getminiteur", HTTP_ANY, [] (AsyncWebServerRequest *request) {
        esp_task_wdt_reset();
        if (request->hasParam("dimmer")) { request->send(200, "application/json",  getMinuteur(programme));  }
        else if (request->hasParam("relay1")) { request->send(200, "application/json",  getMinuteur(programme_relay1)); }
        else if (request->hasParam("relay2")) { request->send(200, "application/json",  getMinuteur(programme_relay2)); }
        else if (request->hasParam("batterie")) { request->send(200, "application/json",  getMinuteur(programme_batterie)); }
        else { request->send(200, "application/json",  getMinuteur());  }
    }); // /get

