xlyric/pv-router-esp32/src/functions/webFunctions.h
    server.on("/setminiteur", HTTP_ANY, [] (AsyncWebServerRequest *request) {
//      String name; 
      if (request->hasParam("dimmer")) { 
              if (request->hasParam("heure_demarrage")) { request->getParam("heure_demarrage")->value().toCharArray(programme.heure_demarrage,6);  }
              if (request->hasParam("heure_arret")) { request->getParam("heure_arret")->value().toCharArray(programme.heure_arret,6);  }
              if (request->hasParam("temperature")) { programme.temperature = request->getParam("temperature")->value().toInt();   }
              if (request->hasParam("puissance")) { programme.puissance = request->getParam("puissance")->value().toInt(); }
              programme.saveProgramme();
        request->send(200, "application/json",  getMinuteur(programme));  
      }
      if (request->hasParam("batterie")) { 
              if (request->hasParam("heure_demarrage")) { request->getParam("heure_demarrage")->value().toCharArray(programme_batterie.heure_demarrage,6);  }
              if (request->hasParam("heure_arret")) { request->getParam("heure_arret")->value().toCharArray(programme_batterie.heure_arret,6);  }
              if (request->hasParam("temperature")) { programme_batterie.temperature = request->getParam("temperature")->value().toInt();   }
              if (request->hasParam("puissance")) { programme_batterie.puissance = request->getParam("puissance")->value().toInt(); }
              programme_batterie.saveProgramme();
        request->send(200, "application/json",  getMinuteur(programme_batterie));  
      }
      if (request->hasParam("relay1")) { 
            if (request->hasParam("heure_demarrage")) { request->getParam("heure_demarrage")->value().toCharArray(programme_relay1.heure_demarrage,6);  }
            if (request->hasParam("heure_arret")) { request->getParam("heure_arret")->value().toCharArray(programme_relay1.heure_arret,6);  }
            if (request->hasParam("temperature")) { programme_relay1.temperature = request->getParam("temperature")->value().toInt();  }
            programme_relay1.saveProgramme(); 
      request->send(200, "application/json",  getMinuteur(programme_relay1)); 
      }
      if (request->hasParam("relay2")) { 
              if (request->hasParam("heure_demarrage")) { request->getParam("heure_demarrage")->value().toCharArray(programme_relay2.heure_demarrage,6);  }
              if (request->hasParam("heure_arret")) { request->getParam("heure_arret")->value().toCharArray(programme_relay2.heure_arret,6);  }
              if (request->hasParam("temperature")) { programme_relay2.temperature = request->getParam("temperature")->value().toInt();  }
              programme_relay2.saveProgramme(); 
        request->send(200, "application/json",  getMinuteur(programme_relay2)); 
      }
      else { request->send(200, "application/json",  getMinuteur()); }
    });

    server.on("/getmemory", HTTP_ANY, [] (AsyncWebServerRequest *request) {
      request->send(200, "application/json",  return_Memory());
    });
  } // call_pages()

//***********************************
//************* getMinuteur(const Programme& minuteur)
//***********************************
String getMinuteur(const Programme& minuteur) {
  JsonDocument doc;
    if (millis() < 5000) {
        Serial.println("System not ready yet");
        esp_task_wdt_reset();
        return "false";
  }
  yield();
  struct tm timeinfo;  // Déclaration locale
  if (!gDisplayValues.Shelly_local) {
        if (!getLocalTime(&timeinfo)) {
          Serial.println("Failed to obtain time");
          esp_task_wdt_reset();
          return "false";
      }
  }
  yield();
  doc["heure_demarrage"] = minuteur.heure_demarrage;
  doc["heure_arret"] = minuteur.heure_arret;
  doc["temperature"] = minuteur.temperature;
  doc["heure"] = timeinfo.tm_hour;
  doc["minute"] = timeinfo.tm_min;
  doc["puissance"] = minuteur.puissance;

  String retour;
  serializeJson(doc, retour);
  return retour;
}

//***********************************
//************* getMinuteur()
//***********************************
String getMinuteur() {
  //if (gDisplayValues.Shelly_local) { return "{}"; } // si Shelly local, pas de minuteur
  JsonDocument doc;
      if (millis() < 5000) {
        Serial.println("System not ready yet");
        esp_task_wdt_reset();
        return "false";
  }
  yield();
  
  struct tm timeinfo;  // Déclaration locale
      if (!getLocalTime(&timeinfo)) {
        Serial.println("Failed to obtain time");
        esp_task_wdt_reset();
        return "false";
    }
  yield();
  doc["heure"] = timeinfo.tm_hour;
  doc["minute"] = timeinfo.tm_min;

  String retour;
  serializeJson(doc, retour);
  return retour;
}

//***********************************
//************* return_Memory()
//***********************************
String return_Memory() {
  JsonDocument doc;
  doc["task_GetDImmerTemp"] = task_mem.task_GetDImmerTemp;
  doc["task_dallas_read"] = task_mem.task_dallas_read;
  doc["task_keepWiFiAlive2"] = task_mem.task_keepWiFiAlive2;
  doc["task_measure_electricity"] = task_mem.task_measure_electricity;
  doc["task_send_mqtt"] = task_mem.task_send_mqtt;
  doc["task_serial_read_task"] = task_mem.task_serial_read_task;
  doc["task_switchDisplay"] = task_mem.task_switchDisplay;
  doc["task_updateDimmer"] = task_mem.task_updateDimmer;
  doc["task_updateDisplay"] = task_mem.task_updateDisplay;
  doc["task_loop"] = task_mem.task_loop;

  String retour;
  serializeJson(doc, retour);
  return retour;
}
#endif
